Конфигурация/src/Documents/ПриходнаяНакладнаяМатериалов/ПриходнаяНакладнаяМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладнаяМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПоставщиками</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ОстаткиПродукции/ОстаткиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияИМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/ВзаиморасчетыСПоставщиками/ВзаиморасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСПоставщиками</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/ПриходнаяНакладнаяМатериалов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// 1. ПОДГОТОВКА: Указываем системе, что мы будем записывать движения в эти регистры.
    Движения.ОстаткиПродукции.Записывать        = Истина; 
    Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
    
    // Инициализируем переменную для подсчета общей суммы документа
    СуммаДокумента = 0;
    
    // 2. ДВИЖЕНИЯ ПО МАТЕРИАЛАМ: Проходим по каждой строке табличной части "Материалы"
    Для Каждого СтрокаТЧ Из Материалы Цикл
        
        // Создаем новое движение (запись) в регистре "ОстаткиПродукции"
        Движение = Движения.ОстаткиПродукции.Добавить();
        
        // Указываем, что это ПРИХОД (увеличение остатков)
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        
        // Указываем дату движения
        Движение.Период     = Дата;
        
        // Заполняем измерения (что пришло)
        Движение.Продукция  = СтрокаТЧ.Материал; 
        
        // Заполняем ресурсы (сколько пришло)
        Движение.Количество = СтрокаТЧ.Количество;
        
        // Накапливаем общую сумму
        СуммаДокумента = СуммаДокумента + СтрокаТЧ.Сумма;
        
        Движение.Сумма      = СтрокаТЧ.Сумма;
        
    КонецЦикла;
    
    // 3. ДВИЖЕНИЯ ПО ВЗАИМОРАСЧЕТАМ: Создаем запись по поставщику на общую сумму
    Если СуммаДокумента > 0 Тогда
    
        // Создаем новое движение (запись) в регистре "ВзаиморасчетыСПоставщиками"
        Движение = Движения.ВзаиморасчетыСПоставщиками.Добавить();
        
        // Указываем, что это ПРИХОД (увеличение нашей задолженности перед поставщиком)
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        
        // Указываем дату движения
        Движение.Период      = Дата;
        
        // Заполняем измерения (с кем возникла задолженность)
        Движение.Поставщик   = Поставщик;
        
        // Заполняем ресурсы (сумма задолженности)
        Движение.СуммаВзаиморасчетов = СуммаДокумента;
        
    КонецЕсли;
    
    // После завершения процедуры, система 1С автоматически запишет все накопленные
    // движения в базу данных, так как мы установили .Записывать = Истина в начале.
КонецПроцедуры
